In [46]:
import pandas as pd
import numpy as np

In [47]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

df

In [48]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [49]:
df1 = pd.DataFrame({"description":["ext ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum"]})

In [50]:
df1

                                                                                                                                             description
0  ext ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only fi...

In [51]:
pd.set_option('display.max_colwidth',150)

In [52]:
df1

                                                                                                                                             description
0  ext ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only fi...

In [53]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [54]:
pd.set_option('display.max_rows',100)
pd.set_option('display.max_columns',100)

In [55]:
df[:500]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
495,496,0,3,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C
496,497,1,1,"Eustis, Miss. Elizabeth Mussey",female,54.0,1,0,36947,78.2667,D20,C
497,498,0,3,"Shellard, Mr. Frederick William",male,NaN,0,0,C.A. 6212,15.1000,NaN,S
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S
499,500,0,3,"Svensson, Mr. Olof",male,24.0,0,0,350035,7.7958,NaN,S

In [56]:
df1['char_len'] = df1['description'].apply(len)

In [57]:
df1

,description,char_len
0,"ext ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only fi...",446

In [58]:
a = "ia am rahu"
len(a)

10

In [59]:
len(a.split())

3

In [60]:
df1['word_count'] = df1['description'].apply(lambda x:len(x.split()))

In [61]:
df1

,description,char_len,word_count
0,"ext ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only fi...",446,71

In [66]:
data = {'text':['Hello data science', 'I love ML', 'I read ml books']}
a = pd.DataFrame(data)

In [67]:
a

                 text
0  Hello data science
1           I love ML
2     I read ml books

In [68]:
a['text_lower'] = a['text'].str.lower()

In [69]:
a['text_upper'] = a['text'].str.upper()

In [70]:
a

                 text          text_lower          text_upper
0  Hello data science  hello data science  HELLO DATA SCIENCE
1           I love ML           i love ml           I LOVE ML
2     I read ml books     i read ml books     I READ ML BOOKS

In [71]:
a['text'][0].startswith('H')

True

In [72]:
df1 = pd.DataFrame({'a':[1,2,4,5,6],
                      'b':[4,5,6,7,8],
})

In [73]:
df1

   a  b
0  1  4
1  2  5
2  4  6
3  5  7
4  6  8

In [74]:
df1['mul'] = df1['a'] * 10

In [75]:
df1

   a  b  mul
0  1  4   10
1  2  5   20
2  4  6   40
3  5  7   50
4  6  8   60

In [76]:
df1.a.mean()

3.6

In [77]:
df1.a.median()

4.0

In [78]:
df1.a.min()

1

In [79]:
df1.a.max()

6

In [80]:
df1.a.sum()

18

In [81]:
df1.a.std()

2.073644135332772

In [83]:
df1.a.var()

4.3

In [84]:
df1.a.describe()

count    5.000000
mean     3.600000
std      2.073644
min      1.000000
25%      2.000000
50%      4.000000
75%      5.000000
max      6.000000
Name: a, dtype: float64

In [85]:
df2 = pd.DataFrame({'a':[1,2,3,4,5,6,7,8,9]})

In [86]:
df2

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [87]:
df2.mean()

a    5.0
dtype: float64

In [88]:
df2.rolling(window= 1).mean()

     a
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0
7  8.0
8  9.0

In [89]:
df2.rolling(window = 2).mean()

     a
0  NaN
1  1.5
2  2.5
3  3.5
4  4.5
5  5.5
6  6.5
7  7.5
8  8.5

In [90]:
df3 = df2.rolling(window = 3).mean()

In [91]:
df3

     a
0  NaN
1  NaN
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [92]:
df3.dropna(inplace = True)

In [93]:
df3

     a
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [94]:
df3['chnage_type' ]= df3['a'].astype(int)

In [95]:
df3

     a  chnage_type
2  2.0            2
3  3.0            3
4  4.0            4
5  5.0            5
6  6.0            6
7  7.0            7
8  8.0            8

In [96]:
df2

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [98]:
df2['group'] = np.random.choice(['A','B'],size = 9)

In [99]:
df2

   a group
0  1     B
1  2     B
2  3     A
3  4     A
4  5     A
5  6     B
6  7     A
7  8     B
8  9     A

In [100]:
df2.groupby('group')['a'].rolling(window = 2).sum()

group
A      2     NaN
       3     7.0
       4     9.0
       6    12.0
       8    16.0
B      0     NaN
       1     3.0
       5     8.0
       7    14.0
Name: a, dtype: float64

In [101]:
df2['a'].cumsum()

0     1
1     3
2     6
3    10
4    15
5    21
6    28
7    36
8    45
Name: a, dtype: int64

In [102]:
df2

   a group
0  1     B
1  2     B
2  3     A
3  4     A
4  5     A
5  6     B
6  7     A
7  8     B
8  9     A

In [103]:
df = pd.DataFrame({"date":["2024-03-08","2024-03-09","2024-03-10"]})

In [104]:
df

         date
0  2024-03-08
1  2024-03-09
2  2024-03-10

In [106]:
df.dtypes

date    object
dtype: object

In [107]:
df['update_date'] = pd.to_datetime(df['date'])

In [108]:
df

         date update_date
0  2024-03-08  2024-03-08
1  2024-03-09  2024-03-09
2  2024-03-10  2024-03-10

In [109]:
df.dtypes

date                   object
update_date    datetime64[ns]
dtype: object

In [116]:
df['year'] = df['update_date'].dt.year

In [117]:
df

         date update_date  year  month
0  2024-03-08  2024-03-08  2024      3
1  2024-03-09  2024-03-09  2024      3
2  2024-03-10  2024-03-10  2024      3

In [118]:
df['month'] = df['update_date'].dt.month

In [119]:
df

         date update_date  year  month
0  2024-03-08  2024-03-08  2024      3
1  2024-03-09  2024-03-09  2024      3
2  2024-03-10  2024-03-10  2024      3

In [120]:
df['day'] = df['update_date'].dt.day

In [121]:
df

         date update_date  year  month  day
0  2024-03-08  2024-03-08  2024      3    8
1  2024-03-09  2024-03-09  2024      3    9
2  2024-03-10  2024-03-10  2024      3   10

In [122]:
pd.date_range(start = '2024-03-10',end ='2025-03-10',freq = 'D')

DatetimeIndex(['2024-03-10', '2024-03-11', '2024-03-12', '2024-03-13',
               '2024-03-14', '2024-03-15', '2024-03-16', '2024-03-17',
               '2024-03-18', '2024-03-19',
               ...
               '2025-03-01', '2025-03-02', '2025-03-03', '2025-03-04',
               '2025-03-05', '2025-03-06', '2025-03-07', '2025-03-08',
               '2025-03-09', '2025-03-10'],
              dtype='datetime64[ns]', length=366, freq='D')

In [123]:
pd.date_range(start = '2024-03-10', end ='2025-03-10', freq = 'H')

DatetimeIndex(['2024-03-10 00:00:00', '2024-03-10 01:00:00',
               '2024-03-10 02:00:00', '2024-03-10 03:00:00',
               '2024-03-10 04:00:00', '2024-03-10 05:00:00',
               '2024-03-10 06:00:00', '2024-03-10 07:00:00',
               '2024-03-10 08:00:00', '2024-03-10 09:00:00',
               ...
               '2025-03-09 15:00:00', '2025-03-09 16:00:00',
               '2025-03-09 17:00:00', '2025-03-09 18:00:00',
               '2025-03-09 19:00:00', '2025-03-09 20:00:00',
               '2025-03-09 21:00:00', '2025-03-09 22:00:00',
               '2025-03-09 23:00:00', '2025-03-10 00:00:00'],
              dtype='datetime64[ns]', length=8761, freq='H')

In [124]:
pd.Timestamp.now()

Timestamp('2024-06-07 17:39:41.300506')

In [125]:
start = pd.Timestamp.now()

for i in range(1000):
    pass

end = pd.Timestamp.now()

print("time taken",end - start)

time taken 0 days 00:00:00.000212